Assignment 3/cavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         35;

deltaT          0.005;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //
functions
{
    forces
    {
        type                forces;
        libs                ("libforces.so");
        writeControl        timeStep;
        writeInterval       10;
        patches             ("square");
        rho                 rhoInf;
        log                 true;
        rhoInf              1.209;
        CofR                (0 0 0);
    }
    
    forceCoeffs
{
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    10;

    log             yes;

    patches         ("square");
    pName           P;
    UName           U;
    
    
    rho             rhoInf;      
    rhoInf          1.209;           
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0 0 0);  
    pitchAxis       (0 0 1);
    magUInf         1;
    lRef            1;       
    Aref            2;    
    
    }
    
    
    
}

